cases/flameletPisoSMOKE/Sandia_COH2N2.oldOF/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.2;
    format      ascii;
    class       dictionary;
    location    "constant/polyMesh";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //                                        
                                        
convertToMeters 1;                  
                                        
vertices                                
(                                       
   (0 0 0)   					// 0
   (0.00228782042306 0  0.00009988839688)   	// 1
   (0.00228782042306 0 -0.00009988839688)   	// 2

   (0 0.93 0)   				// 3
   (0.00228782042306 0.93  0.00009988839688)   	// 4
   (0.00228782042306 0.93 -0.00009988839688)   	// 5

   (0 -0.07 0)  	 			// 6
   (0.00228782042306 -0.07  0.00009988839688)   // 7
   (0.00228782042306 -0.07 -0.00009988839688)   // 8

   (0.00316698285926 0     0.00013827345781)   	// 9
   (0.00316698285926 0    -0.00013827345781)  	// 10
   (0.00316698285926 0.93  0.00013827345781)   	// 11
   (0.00316698285926 0.93 -0.00013827345781)   	// 12

   (0.03996192886327 0.00  0.00174477549461)   	// 13
   (0.03996192886327 0.00 -0.00174477549461)    // 14
   (0.03996192886327 0.93  0.00174477549461)  	// 15
   (0.03996192886327 0.93 -0.00174477549461)   	// 16

   (0.00316698285926 -0.07  0.00013827345781)   // 17
   (0.00316698285926 -0.07 -0.00013827345781)   // 18
   (0.03996192886327 -0.07  0.00174477549461)   // 19
   (0.03996192886327 -0.07 -0.00174477549461)   // 20

// Erster Outlet 3 Teile
   (0.04995238610289 -0.07  0.00218096827778)   // 21
   (0.04995238610289 -0.07 -0.00218096827778)   // 22
   (0.04995238610289  0     0.00218096827778)	// 23
   (0.04995238610289  0    -0.00218096827778)	// 24 

   (0.04995238610289 0.43  0.00218096827778)   	// 25
   (0.04995238610289 0.43 -0.00218096827778)    // 26

   (0.03996192886327 0.93  0.00174477549461)  	// 15
   (0.03996192886327 0.93 -0.00174477549461)   	// 16  
   (0.04995238610289 0.93  0.00218096827778)	// 29
   (0.04995238610289 0.93 -0.00218096827778)	// 30

// Zwischenstück
   (0.09990479718198 -0.07  0.00436193764605)   // 31
   (0.09990479718198 -0.07 -0.00436193764605)   // 32  

   (0.09990479718198 -0.0  0.00436193764605)   	// 33
   (0.09990479718198 -0.0 -0.00436193764605)    // 34

   (0.09990479718198 0.43  0.00436193764605)   	// 35
   (0.09990479718198 0.43 -0.00436193764605)    // 36

// Zweiter Outlet 
   (0.1098952793978 -0.07  0.0047981315197)   	// 37
   (0.1098952793978 -0.07 -0.0047981315197)     // 38  

   (0.1098952793978 -0.0  0.0047981315197)   	// 39
   (0.1098952793978 -0.0 -0.0047981315197)    	// 40
  
   (0.1098952793978 0.43  0.0047981315197)   	// 41
   (0.1098952793978 0.43 -0.0047981315197)      // 42  
 
   (0.09990479718198 0.93  0.00436193764605)   	// 43
   (0.09990479718198 0.93 -0.00436193764605)   	// 44   
   (0.1098952793978 0.93  0.0047981315197)   	// 45
   (0.1098952793978 0.93 -0.0047981315197)    	// 46  

// Zwischenstück
   (0.1598477154531 -0.07  0.00697910197845)   	// 47
   (0.1598477154531 -0.07 -0.00697910197845)    // 48  

   (0.1598477154531 -0.0  0.00697910197845)   	// 49
   (0.1598477154531 -0.0 -0.00697910197845)     // 50

   (0.1598477154531 0.43  0.00697910197845)   	// 51
   (0.1598477154531 0.43 -0.00697910197845)     // 52

 
 // Dritter Outlet 
   (0.16983819766892 -0.07  0.00741529585211)   // 53
   (0.16983819766892 -0.07 -0.00741529585211)   // 54  

   (0.16983819766892 -0.0  0.00741529585211)   	// 55
   (0.16983819766892 -0.0 -0.00741529585211)    // 56
  
   (0.16983819766892 0.43  0.00741529585211)   	// 57
   (0.16983819766892 0.43 -0.00741529585211)    // 58  
 
   (0.1598477154531 0.93  0.00697910197845)  	// 59
   (0.1598477154531 0.93 -0.00697910197845) 	// 60   
   (0.16983819766892 0.93  0.00741529585211)   	// 61
   (0.16983819766892 0.93 -0.00741529585211)   	// 62   
   
// Zwischenstück
   (0.17982867988473 -0.07  0.00785148972576)   // 63
   (0.17982867988473 -0.07 -0.00785148972576)   // 64  

   (0.17982867988473 -0.0  0.00785148972576)   	// 65
   (0.17982867988473 -0.0 -0.00785148972576)    // 66

   (0.17982867988473 0.93  0.00785148972576)   	// 77
   (0.17982867988473 0.93 -0.00785148972576)    // 78

);

blocks
( 				    //(h  e  v )	
	hex (0 1 2 0 3 4 5 3)         (3  1  120)   simpleGrading (1 1 15)
	hex (6 7 8 6 0 1 2 0)         (3  1  40)    simpleGrading (1 1 0.6)
	hex (1 9 10 2 4 11 12 5)      (1  1  120)   simpleGrading (1 1 15)
	hex (9 65 66 10 11 67 68 12)  (60 1 120)   simpleGrading (4 1 15)
	hex (17 63 64 18 9 65 66 10)  (60 1 40)    simpleGrading (4 1 0.6)

	// Erster Outlet
	//hex (19 21 22 20 13 23 24 14) (30 1 50)    simpleGrading (1 1 1)
	//hex (13 23 24 14 15 25 26 16) (30 1 300)   simpleGrading (1 1 1)
   	//hex (15 25 26 16 27 29 30 28) (30 1 180)   simpleGrading (1 1 3)

	// Zwischenstück
	//hex (21 31 32 22 23 33 34 24) (150 1 50)   simpleGrading (1 1 1)
	//hex (23 33 34 24 25 35 36 26) (150 1 300)  simpleGrading (1 1 1)

	// Zweiter Outlet
	//hex (31 37 38 32 33 39 40 34) (30 1 50)    simpleGrading (1 1 1)
	//hex (33 39 40 34 35 41 42 36) (30 1 300)   simpleGrading (1 1 1)
	//hex (35 41 42 36 43 45 46 44) (30 1 180)   simpleGrading (1 1 3)

	// Zwischenstück
	//hex (37 47 48 38 39 49 50 40) (150 1 50)   simpleGrading (1 1 1)
	//hex (39 49 50 40 41 51 52 42) (150 1 300)  simpleGrading (1 1 1)

	// Dritter Outlet
	//hex (47 53 54 48 49 55 56 50) (30 1 50)	   simpleGrading (1 1 1)
	//hex (49 55 56 50 51 57 58 52) (30 1 300)   simpleGrading (1 1 1)
	//hex (51 57 58 52 59 61 62 60) (30 1 180)   simpleGrading (1 1 3)

	// Zwischenstück
	//hex (53 63 64 54 55 65 66 56) (30 1 50)   simpleGrading (1 1 1)
	//hex (55 65 66 56 57 67 68 58) (30 1 300)  simpleGrading (1 1 1)
);
                                     
edges                                
(                                    
);                                   
                                     
patches                              
(                                    
    patch inletfuel                  
    (                                
        (6 7 8 6)                    
    )                                
                                     
    patch inletair                   
    (                                
        (17 63 64 18)
//	(19 21 22 20)
//	(21 31 32 22)
//	(31 37 38 32)
//	(37 47 48 38)
//	(47 53 54 48)
//	(53 63 64 54) 
    )                                
                     
                
    patch outlet                     
    (
	(3 4 5 3)
	(4 11 12 5)
	(11 67 68 12)
//	(59 61 62 60)
    )                                
                                     
    empty axis                       
    (                                
        (0 3 3 0)                    
        (0 6 6 0)                    
    )                                
    
                                 
    wall sidewall
    (                                    
	(63 64 66 65)
	(65 66 68 67)
    )                                

//    wall outletwall
//    (
//	(15 16 28 27)
//	(25 26 30 29)
//
//	(35 43 44 36)
//	(41 45 46 42)
//
//	(51 52 60 59)
//	(57 58 62 61)
//    )

//    wall topwall
//    (
//	(3 4 5 3)
//	(4 11 12 5)
//	(11 15 16 12)
//	(25 35 36 26)
//	(41 51 52 42)
//	(57 67 68 58)
//    )
                                     
    wall burnerwall                  
    (                                
        (7 1 2 8)                    
        (1 9 10 2)                 
        (9 10 18 17)                   
    )                                
                                     
    wedge front                      
    (
	(3 4 1 0)
	(0 1 7 6)

	(4 11 9 1)

	(17 63 65 9)
	(9 65 67 11)

//	(19 21 23 13)
//	(13 23 25 15)
//	(15 25 29 27)

//	(21 31 33 23)
//	(23 33 35 25)

//	(31 37 39 33)
//	(33 39 41 35)
//	(35 41 45 43)

//	(37 47 49 39)
//	(39 49 51 41)

//	(47 53 55 49)
//	(49 55 57 51)
//	(51 57 61 59)

//	(53 63 65 55)
//	(55 65 67 57)
	
    )                                
                                     
    wedge back                       
    (
	(3 5 2 0)
	(0 2 8 6)
	
	(5 12 10 2)

	(18 64 66 10)
	(10 66 68 12)

//	(20 22 24 14)
//	(14 24 26 16)
//	(16 26 30 28)
	
//	(22 32 34 24)
//	(24 34 36 26)

//	(32 38 40 34)
//	(34 40 42 36)
//	(36 42 46 44)

//	(38 48 50 40)
//	(40 50 52 42)

//	(48 54 56 50)
//	(50 56 58 52)
//	(52 58 62 60)

//	(54 64 66 56)
//	(56 66 68 58)
    )                             
                                     
);                                   
                                     
mergePatchPairs                      
(                                    
);                                   
					    
